const input = document.querySelector('input');

input.addEventListener('input', updateValue);

// default theme 
var currenttheme = 'dark';

function themeToggle() {
	if (currenttheme === 'light') {

		// GET THE HELL OUT OF THERE! THEME IS NOTHING TO SEE!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!1

		// document.documentElement.style.setProperty('--current-bg', '#fff');
		// document.documentElement.style.setProperty('--current-fg', '#000');

		// document.documentElement.style.setProperty('--current-cmd', '#6a00a7');
		// document.documentElement.style.setProperty('--current-t-bg', '#ddd');
		// document.documentElement.style.setProperty('--current-t-bg2', '#ccc');

	}
}


function min7()
{
	var Number = 1000;
	var lastNum = -1;
	var counter=setInterval(appendS, 10);

	const parg = document.querySelector("#minusSEVEN");
	var step = 7;
	
	
	function appendS()
	{
		parg.textContent += Number + "-7 ";
		Number -= 7;
		
		if ( Number < -1 )
		{
			parg.textContent = parg.textContent.slice(0,-3) + "... норм) Пойду ка обратно под крыльцо к вадимке.............. я же ДЕД ИНСАЕТ ЕГОРЛЬ) кодекс dead inside гуля 1. ты не клоун. если ты ставишь себе на аву гуля, спамишь zxczxczcxczcxzxc, ставишь паузы после каждого кила без причин и просто позер - то это не значит, что ты гуль, и права называть себя им не имеешь 2. тебе должно быть пoxyй. ты аморал, без нравственных качеств. тебя послали нaxyй, сказали что ты бездарь? не позорься, не оправдывайся, не отвечай, хочешь доказать - докажи на деле, уничтожь в zxc, ты не терпила, ты не тратишь свое время. ты обещал разбить вещи? бей их, встань в амулет, отвечай за слова 3. не выeбывaйcя. у тебя 3к птс и ты пuздuшь что смурф? закрой рот, это твой ммр, ты играешь на победу и не присваивай себе заслуг, которых не добился. тебе никто ничего не обязан и ты тоже. если ты ломаешь вещи из за того, что тебе не пикнули саппорта - ты нытик, ты не гуль`4. каждый гуль должен хотя бы знать что такое zxc, а тем более уметь там постоять за себя. если для мужчин нормальна случайность обменяться кулаками с другим мужчиной, то так же норма для гуля ответить или заставить ответить за слова в zxc. не будь тряпкой, ты сильнее 5. сосредотачивайся на игре, zitraks mod. твоя главная цель победить, ты должен уметь давать all mute, справляться с тильтом и выигрывать непобедимое. враги должны бояться гулей, а не смеяться с рейдж бб нытика6. если ты достоин называться гулем, то ты априоре ставишь себя выше остальных. если ты уверен в себе, то забирай роль, фпшь героя, твоя игра - твои правила, но не руинь, пока не заруинили тебе. пикнули дабл мид? иди на сфе в лес и тащи соло, не забудь поставить паузу при смерти yeбaнa и потапать на него, насмехайся над ними, но не становись посмешищем, выигрывай все игры, если команда сама не захотела или не заслужила поражения, выбор твой 7. all chat для тебя не существует, зачем тебе писать врагам что то, кроме \"?\" после убийств и \")\" после падения трона? 8. убил мидера на фб? f9 + ?. у врага падает трон? \")\" в all chat, но не больше, ты не clown. 9. гули нормальные, ты не токсик свинья и позер, ты нормальный, порофли с тимой если хочешь, хорошо общайся со своими ребятами если нужно, уважай тех, кто действительно этого достоин. 10. ЧСВ - положительное качество, ты сильнее и лучше всех, НО ты должен это оправдывать 11. будь верен своим идеалам. тебе не обязательно иметь гуля на аве, к чему это, поставь лил пипа или гослинга если хочешь, держись идеалов, но твой ник не должен быть отвратительным 12. никогда не пиши заглавными буквами. пиши размеренно и по правилам, не будь быдлом, ведь это низко 13. запомни в последний раз, ты не клоун, не позер и не нытик. ты - гуль, не позорься и не строй из себя не пойми что 14. соблюдай все правила, либо ты не гуль Тебе 15 лет, в школе по английскому тройбан, ты спамишь на стеночке вк и стиме ахуевшие цитатки, чб аватарочка, по канончику все паблики( желательно) в стиле ghoul re zxcaasghaghah ты дохуя агрессивный челик, но если заорешь матом то мама инет выключит, дебил малолетний, ты же ахуеть какой originalный, в плейлисте конволк и лилпип, ахуеть какой depressed broken hearted!эх, как же хочется няшиться all mut блиииииииииииин, мама не разрешает волосы покрасить как у канеки, НЕ ХОЧУ ЖИТЬ, ну это TILT АЗХАЗХВАВАХВАХ БЛЯТЬ ЕЩЁ И ТЯНОЧКА ЗАФРЕНДЗОНИЛА И ТЫ СИДИШЬ В ВОЙС ГОВОРИШЬ ЧТО ТЕБЕ ПОХУЙ НА ИГРУ И КОМАНДА БЕЗДАРЕЙ, ИМЕЯ КДА МЕНЬШЕ ЕДЕНИЦЫ tomorrow will only get worse sh4dowww HOPE deceiving I’m sorry, I’m sorry, I’m sorry, I’m sorry, I’m sorry, I’m sorry, I’m sorry, I’m sorry, I’m sorry, I’m sorry, I’m sorry, I’m sorry depressed kid of the Internet we fell in love in may wanna kill myself , because u ignore me... ах да, обязательно поставь Место работы: depressed+tilted Город: Tokyo 高槻 泉 私の手を離さないで АЗХАВЗХВАЗХВАВАЗХАЗХАЗХ ochen\" zhalka 4to ya piwu na translite all mutall mutall mutall mutall mutall mutall mutall mutall mutall mutall mutall ошиете ошиете йо соно шикуми во боку на ни даре га иру но коварета коварета йо коно секаи де кими га варау нанимо миезу ни коварета боку нанте са ики во томете ходокенаи мо хотокенай йо шинджицу сае фриз ковасеру ковасенай куруеру куруенай аната во митсуке юрета СЕКАЙ НИ ДАН ДАН БОКУ ВА СУКИТОТЕ МИНЕНАКУ НАТЕ МИТСУКЕНАЙДЕ БОКУ НО КОТО ВО мицукетайде ДАРЕКА ГА ЕГАЙТА СЕКАЙ НО НАКА ЛЕ АНАТА ВО КИЗУЦУКЕТАКУ ВА НАЙ ЙО ОБОЕЙТЕ БОКУ НО КОТО ВО АЗАЯКА на мама муген ни хирогару кодоку га сасате угокенаи угокенаи угокенаи угокенаи угокенаи угокенаи йо унравелинг зе ворлд кавате шимата каераренаката футацу карамару футари га хоробиру ковасеру ковасенай куруеру куруенай аната во кегасенай йо юрета СЕКАЙ НИ ДАН ДАН БОКУ ВА СУКИТОТЕ МИЕНАКУ НАТЕ МИТСУКЕНАЙДЕ БОКУ НО КОТО ВО мицукетайде ДАРЕКА ГА ШИКУНДА КОДОКУ НА ВАНА НИ МИРАИ ГА ХОДОКЕТЕ ШИМАУ МАЕ НИ ОМОИДАШИТЕ БОКУ НО КОТО ВО АЗАЯКА на мама васуренайде васуренайде васуренайде васуренайде кавате шимата кото ни паралайз каераренай кото дараке но парадайз обоетейте боку но кото во ошиете ошиете боку на нака ни даре га иру но 教えて 教えてよ その仕組みを 僕の中に誰がいるの? 壊れた 壊れたよ この世界で 君が笑う 何も見えずに 	壊れた僕なんてさ 息を止めて ほどけない もう ほどけないよ 真実さえ freeze 壊せる 壊せない 狂える 狂えない あなたを見つけて 揺れた 歪んだ世界にだんだん僕は 透き通って見えなくなって 見つけないで 僕のことを 見つめないで 誰かが描いた世界の中で あなたを傷つけたくはないよ 覚えていて 僕のことを 鮮やかなまま 無限に広がる孤独が絡まる 無邪気に笑った記憶が刺さって 動けない 動けない 動けない 動けない 動けない 動けないよ Unravelling the world 変わってしまった 変えられなかった 2つが絡まる 2人が滅びる 壊せる 壊せない 狂える 狂えない あなたを汚せないよ 揺れた 歪んだ世界にだんだん僕は 透き通って見えなくなって 見つけないで 僕のことを 見つめないで 誰かが仕組んだ孤独な罠に 未来がほどけてしまう前に 思い出して 僕のことを 鮮やかなまま 忘れないで 忘れないで 忘れないで 忘れないで 変わってしまったことに paralyze 変えられないことだらけの paradise 覚えていて 僕のことを 教えて 教えて 僕の中に誰がいるの? -Блин кого бы в дотке пикнуть? Не знаю вообще. - мэнчик, щас лесной падж - это meта play, шаришь? берешь толстозадого и пошуршал creeps'ов стругать, к пятой минуте вывозишь mom'чик, а там и рампага не за горами, полный ace. -Блииин, совсем забыл о нем, неплохая тема, откуда такой скилл? - ну а чего ты думал, Украина из 2К eleven доминирует в дотке, да, в юности мы все этим баловались, но лучше не перебарщивать, как говорится, а то так никогда и не сбросишь листву, и станешь киберспортсменом, прости господи. - согласен, ведь компьютерные игры вызывают зависимость, а иногда даже и столбняк, + лучевую болезнь, + ангидроз, + вибриоз, + аденоиды, + уритринт, + кандидоз, + ротовирусная инфекция, + аутизм, + эпахондрия, + нейродирмит, + эвроглифоз, + парадантоз, + укачивание, + тахикардия, + инсульт, + невроз, + хламидиоз, + угри, + йодонедостаточность, + ожирение гуль - не канеки кен на аве и не зитракс в подписках. гуль это идеология, это культура. либо ты не называешь себя гулем, либо следуешь кодексу. 1. ты не клоун. если ты ставишь себе на аву гуля, спамишь zxczxczcxczcxzxc, ставишь паузы после каждого кила без причин и просто позер - то ты не гуль и не называй себя так 2. тебе должно быть плевать. ты аморал, без нравственных качеств. тебя послали *****, сказали что ты бездарь? не позорься, не оправдывайся, не отвечай, хочешь доказать - докажи на деле, уничтожь в zxc, ты не терпила, ты не тратишь свое время. ты обещал разбить вещи? бей их, встань в амулет, отвечай за слова 3. не выделывайся. у тебя 3к птс и ты говоришь что смурф? закрой рот, это твой ммр, ты играешь на победу и не присваивай себе заслуг, которых не добился. тебе никто ничего не обязан и ты тоже. если ты ломаешь вещи из за того, что тебе не пикнули саппорта - ты нытик, ты не гуль 4. каждый гуль должен хотя бы знать что такое zxc, а тем более уметь там постоять за себя. если для мужчин нормальна случайность обменяться кулаками с другим мужчиной, то так же норма для гуля ответить или заставить ответить за слова в zxc. не будь тряпкой, ты сильнее 5. сосредотачивайся на игре, zitraks mod. твоя главная цель победить, ты должен уметь давать all mute, справляться с тильтом и выигрывать непобедимое. враги должны бояться гулей, а не смеяться с рейдж бб нытика 6. если ты достоин называться гулем, то ты априоре ставишь себя выше остальных. если ты уверен в себе, то забирай роль, фпшь героя, твоя игра твои правила, но не руинь, пока не заруинили тебе. пикнули дабл мид? иди на сфе в лес и тащи соло, не забудь поставить паузу при смерти дурачка и потапать на него, насмехайся над ними, но не становись посмешищем, выигрывай все игры, если команда сама не захотела или не заслужила поражения, выбор твой 7. all chat для тебя не существует, зачем тебе писать врагам что то, кроме ? после убийств 8. убил мидера на фб? f9 + ?. у врага падает трон? ) в all chat, но не больше, ты не clown. 8. гули нормальные, ты не токсик свинья и позер, ты нормальный, порофли с тимой если хочешь, хорошо общайся со своими ребятами если нужно, уважай тех, кто действительно этого достоин 9. чсв - положительное качество, ты сильнее и лучше всех, но ты должен это оправдывать 10. будь верен своим идеалам. тебе не обязательно иметь гуля на аве, к чему это, поставь лил пипа или гослинга если хочешь, держись идеалов, но твой ник не должен быть отвратительным 11. никогда не пиши заглавными буквами. пиши размеренно и по правилам, не будь быдло, это низко 12. запомни в последний раз, ты не клоун, не позер и не нытик, ты гуль, не позорься и строй из себя не пойми что 13. соблюдай все правила, либо ты не гуль";
			clearInterval(counter);
			return;
		}
	}

}



function updateValue(e) {

	switch (input.value) {
		
		// help command
		case 'help':
			document.querySelector("#help").style.top = '80%';
			document.querySelector("#input-source").style.color = 'orange';
			break;

		// links command
		case 'links':
			document.querySelector("#links").style.top = '80%';
			document.querySelector("#input-source").style.color = 'orange';
			break;

		// repositories command
		case 'repos':
			document.querySelector("#repos").style.top = '80%';
			document.querySelector("#input-source").style.color = 'orange';
			break;
		
		// toggle light theme
		case 'theme@light':
			currenttheme = 'light';
			themeToggle();
			input.value = '';
			alert('woah? it didnt work?!');
			break;

		// toggle dark theme
		case 'theme@dark':
			currenttheme = 'dark';
			themeToggle();
			input.value = '';
			alert('same?????????? why it doesnt work ?!!');
			break;

		case '1000-7':
			document.querySelector("#input-source").style.color = 'red';
			document.querySelector("#oneKminusseven").style.display = 'block';
			document.querySelector("#oneKminusseven").style.position = 'absolute';
			min7();
			// alert("ИХИХИХИХ");
			break;

		default:
			document.querySelector("#input-source").style.color = 'white';
			document.querySelector("#help").style.top = '120%';
			document.querySelector("#links").style.top = '120%';
			document.querySelector("#repos").style.top = '120%';
			document.querySelector("#oneKminusseven").style.display = "none";
			document.querySelector("#minusSEVEN").textContent = '';
		}
}
